const menuData = {
  "Πρωινά": [
    ["Τοστ με τυρί","2,50€"],
    ["Τοστ με τυρί & γαλοπούλα","3,00€"],
    ["Κρουασάν βουτύρου","3,00€"],
    ["Κρουασάν με τυρί, ντομάτα, γαλοπούλα & μαγιονέζα","4,50€"],
    ["Κρουασάν με πραλίνα φουντουκιού / λευκή σοκολάτα","4,00€"],
    ["Κρουασάν με πραλίνα φουντουκιού & λευκή σοκολάτα","4,50€"],
    ["Γιαούρτι με μέλι & καρύδια","6,50€"],
    ["Γιαούρτι με φρούτα εποχής","8,00€"],
    ["Πίτα ημέρας","8,00€"],
    ["Σάντουιτς με τυρί, ντομάτα, γαλοπούλα & μαγιονέζα","6,50€"],
    ["Σάντουιτς με φέτα, ντομάτα, αγγούρι & ελιά","6,50€"],
    ["Τορτίγια με τόνο","7,50€"],
    ["Ομελέτα με φέτα, ντομάτα, πιπεριά & κρεμμύδι","9,00€"],
    ["Ομελέτα με κίτρινα τυριά, ντομάτα & μπέικον","9,00€"],
    ["Στραπατσάδα με φέτα","9,00€"],
    ["Στραπατσάδα με κίτρινα τυριά & μπέικον","9,00€"],
    ["Τηγανητά αυγά","7,00€"]
  ],

  "Ροφήματα":[
    ["Φρέσκος χυμός πορτοκάλι","5,00€"],
    ["Φρέσκος ανάμεικτος χυμός","6,50€"],
    ["Χυμός Amita","2,50€"],
    ["Σοκολάτα κρύα / ζεστή","4,00€"],
    ["Κρύο Τσάι Ροδάκινο / Λεμόνι / Πράσινο","3,50€"],
    ["Ζεστό Τσάι","3,50€"]
  ],

  "Καφέδες":[
    ["Ελληνικός μονός","2,00€"],
    ["Ελληνικός διπλός","3,00€"],
    ["Espresso μονό","2,00€"],
    ["Espresso Macchiato","3,00€"],
    ["Espresso διπλό","3,00€"],
    ["Freddo Espresso","3,50€"],
    ["Freddo Cappuccino","4,00€"],
    ["Cappuccino μονό","3,00€"],
    ["Cappuccino διπλό","4,00€"],
    ["Ζεστό Latte","4,50€"],
    ["Κρύο Latte","4,50€"],
    ["Flat White","4,00€"],
    ["Αμερικάνο","3,50€"],
    ["Καφές φίλτρου","3,00€"],
    ["Φραπές","3,50€"]
  ],

  "Αναψυκτικά":[
    ["Coca-Cola / Zero / Light","2,50€"],
    ["Πορτοκαλάδα","2,50€"],
    ["Πορτοκαλάδα χωρίς ανθρακικό","2,50€"],
    ["Λεμονάδα","2,50€"],
    ["Sprite","2,50€"],
    ["Σόδα","2,50€"],
    ["Pink Soda","3,50€"],
    ["Τόνικ","2,50€"],
    ["Ανθρακούχο νερό 500ml","2,50€"],
    ["Ανθρακούχο νερό 1lt","4,00€"],
    ["Νερό 500ml","0,50€"],
    ["Νερό 1.5lt","1,50€"]
  ],

  "Τσίπουρο":[
    ["Δεκαράκι","12,00€"],
    ["Τσιλιλή","10,00€"],
    ["Ηδονικό","12,00€"],
    ["Μπαμπατζίμ","12,00€"],
    ["18 Γράδα","10,00€"],
    ["Τσίπουρο χύμα 100ml","5,00€"],
    ["Τσίπουρο χύμα 200ml","8,00€"]
  ],

  "Ούζο":[
    ["Βαρβαγιάννη","12,00€"],
    ["Πλωμάρι","10,00€"],
    ["Μίνι","10,00€"],
    ["Ούζο χύμα 100ml","5,00€"],
    ["Ούζο χύμα 200ml","8,00€"]
  ],

  "Κρασί":[
    ["Λευκό 250ml","4,50€"],
    ["Λευκό 500ml","8,00€"],
    ["Ροζέ 250ml","4,50€"],
    ["Ροζέ 500ml","8,00€"],
    ["Κόκκινο ξηρό / ημίγλυκο 250ml","4,50€"],
    ["Κόκκινο ξηρό / ημίγλυκο 500ml","8,00€"],
    ["Ρετσίνα 500ml","6,00€"]
  ],

  "Μπύρες":[
    ["Άλφα 330ml","3,50€"],
    ["Μάμος 330ml","3,50€"],
    ["Fix 330ml","3,50€"],
    ["Φίσερ 330ml","4,00€"],
    ["Κερκυραϊκή Pilsner 330ml","5,00€"],
    ["Κορυφώ Κερκυραϊκή Lager 330ml","5,00€"],
    ["Κάιζερ 330ml","4,00€"],
    ["Ράντλερ 330ml","3,50€"],
    ["Άλφα Άνευ 330ml","3,50€"],
    ["Μύθος 500ml","6,00€"],
    ["Νύμφη 500ml","6,00€"],
    ["We Sail On Hops IPA 500ml","8,00€"]
  ],

  "Λικέρ":[
    ["Μαστίχα","5,50€"],
    ["Λεμοντσέλο","5,50€"]
  ],

  "Ποτά":[
    ["Ρούμι","8,00€"],
    ["Τζιν","8,00€"],
    ["Βότκα","8,00€"],
    ["Ουίσκι","8,00€"],
    ["Τεκίλα","8,00€"],
    ["Σφηνάκι","3,00€"]
  ],

  "Μεζέδες":[
    ["Χωριάτικη","9,50€"],
    ["Ντάκος","9,00€"],
    ["Πράσινη σαλάτα","9,00€"],
    ["Τζατζίκι","5,00€"],
    ["Τυροκαυτερή","5,50€"],
    ["Ταραμοσαλάτα","5,50€"],
    ["Παντζαροσαλάτα","6,00€"],
    ["Φάβα","5,50€"],
    ["Πατάτες τηγανητές","4,50€"],
    ["Ταλαγάνι","8,00€"],
    ["Μπουγιουρντί","8,00€"],
    ["Μανιτάρια ψητά","8,00€"],
    ["Ντολμαδάκια","7,00€"],
    ["Πίτα ημέρας","8,00€"],
    ["Τηγανιά κοτόπουλο","12,00€"],
    ["Λουκάνικο","12,00€"],
    ["Μπριζολάκια λαιμού","13,00€"],
    ["Μπεκρή μεζές","12,00€"],
    ["Σουτζουκάκια","13,00€"],
    ["Καλαμαράκια","14,00€"],
    ["Γαριδάκι γάμπαρη","12,00€"],
    ["Γαρίδες σαγανάκι","14,00€"],
    ["Φρέσκο ψάρι ημέρας","13,00€"]
  ],

  "Επιδόρπια":[
    ["Παγωτό","2,50€"]
  ]
};

const menu = document.getElementById("menu");

for (const category in menuData) {
  menu.innerHTML += 
    <section class="category">
      <h2>${category}</h2>
      ${menuData[category]
        .map(item => 
          <div class="item">
              <span>${item[0]}</span>
              <span>${item[1]}</span>
          </div>
        ).join("")}
    </section>
  ;
}
